export const provincesAndCities: Record<string, string[]> = {
    'آذربایجان شرقی': [
    'تبریز','مراغه','مرند','شبستر','اهر','بناب','میانه','جلفا','سراب','هریس','چاراویماق','خداآفرین','عجب‌شیر','کلیبر','ملکان','آذرشهر','اسکو','ورزقان','بستان‌آباد'
  ],
  'آذربایجان غربی': [
    'ارومیه','خوی','میاندواب','بوکان','مهاباد','سلماس','نقده','پیرانشهر','سردشت','شاهین‌دژ','اشنویه','چالدران','ماکو','چایپاره','پلدشت','تکاب'
  ],
  'اردبیل': [
    'اردبیل','مشگین‌شهر','پارس‌آباد','بیله‌سوار','خلخال','نیر','نمین','کوثر','گرمی'
  ],
  'اصفهان': [
    'اصفهان','کاشان','خمینی‌شهر','نجف‌آباد','فلاورجان','شاهین‌شهر','لنجان','گلپایگان','نطنز','مبارکه','شهرضا','آران و بیدگل','سمیرم','اردستان',
    'فریدن','فریدون‌شهر','تیران و کرون','چادگان','خور و بیابانک','دهاقان','برخوار'
  ],
  'البرز': [
    'کرج','فردیس','نظرآباد','ساوجبلاغ','طالقان','اشتهارد'
  ],
  'ایلام': [
    'ایلام','دهلران','چرداول','دره‌شهر','آبدانان','ایوان','مهران','ملکشاهی','سیروان'
  ],
  'بوشهر': [
    'بوشهر','برازجان','گناوه','دیر','کنگان','جم','دشتی','دلوار','دیلم','خوشاب'
  ],
  'تهران': [
    'تهران','اسلام‌شهر','گلستان','قدس','ملارد','ورامین','شهریار','بهارستان','پردیس','دماوند','شمیرانات','ری','فیروزکوه','پاکدشت'
  ],
  'چهارمحال و بختیاری': [
    'شهرکرد','بروجن','فارسان','لردگان','کوهرنگ','اردل','کیار','سامان'
  ],
  'خراسان جنوبی': [
    'بیرجند','طبس','قاین','فردوس','سربیشه','بشرویه','نهبندان','درمیان','خوسف'
  ],
  'خراسان رضوی': [
    'مشهد','نیشابور','سبزوار','تربت حیدریه','کاشمر','قوچان','تربت جام','گناباد','چناران','درگز','بینالود','بردسکن','طرقبه شاندیز','مه‌ولات','رشتخوار','خواف'
  ],
  'خراسان شمالی': [
    'بجنورد','شیروان','اسفراین','مانه و سملقان','جاجرم','فاروج','گرمه','راز و جرگلان'
  ],
  'خوزستان': [
    'اهواز','آبادان','خرمشهر','ماهشهر','دزفول','شوش','اندیمشک','بهبهان','ایذه','شادگان','امیدیه','هندیجان','رامهرمز','رامشیر','حمیدیه','باوی','کارون','گتوند','لالی','هویزه'
  ],
  'زنجان': [
    'زنجان','ابهر','خدابنده','خرمدره','طارم','ماهنشان','ایجرود','سلطانیه'
  ],
  'سمنان': [
    'سمنان','شاهرود','دامغان','گرمسار','مهدی‌شهر','میامی','سرخه','آرادان'
  ],
  'سیستان و بلوچستان': [
    'زاهدان','چابهار','ایرانشهر','زابل','خاش','سراوان','کنارک','نیک‌شهر','زهک','دلگان','مهرستان','فنوج','قصرقند','هامون','سیب و سوران'
  ],
  'فارس': [
    'شیراز','مرودشت','کازرون','لارستان','داراب','فسا','جهرم','ممسنی','سپیدان','نی‌ریز',
    'زرین‌دشت','لامرد','مهر','ارسنجان','استهبان','فیروزآباد','سروستان','خنج','بوانات'
  ],
  'قزوین': [
    'قزوین','البرز','آبیک','تاکستان','بوئین‌زهرا'
  ],
  'قم': [
    'قم'
  ],
  'کردستان': [
    'سنندج','سقز','بانه','مریوان','قروه','بیجار','دیواندره','کامیاران','دهگلان'
  ],
  'کرمان': [
    'کرمان','رفسنجان','جیرفت','بم','سیرجان','زرند','بردسیر','بافت','راور','کهنوج','ریگان','انار','فهرج','قلعه‌گنج','منوجان','رابر'
  ],
  'کرمانشاه': [
    'کرمانشاه','اسلام‌آباد غرب','سنقر','پاوه','سرپل ذهاب','کنگاور','صحنه','جوانرود','گیلانغرب','هرسین'
  ],
  'کهگیلویه و بویراحمد': [
    'یاسوج','گچساران','دهدشت','لیکک','دنا','لنده'
  ],
  'گلستان': [
    'گرگان','گنبد کاووس','علی‌آباد کتول','آق‌قلا','مینودشت','کردکوی','کلاله','بندر ترکمن','رامیان','گمیشان','بندر گز'
  ],
  'گیلان': [
    'رشت','لاهیجان','انزلی','لنگرود','رودسر','تالش','آستارا','فومن','صومعه‌سرا','آستانه اشرفیه','شفت','رضوانشهر','املش','ماسال'
  ],
  'لرستان': [
    'خرم‌آباد','بروجرد','دورود','الیگودرز','کوهدشت','دلفان','ازنا','پلدختر','سلسله','رومشکان'
  ],
  'مازندران': [
    'ساری','بابل','آمل','قائم‌شهر','نوشهر','چالوس','تنکابن','بابلسر','بهشهر','نور','نکا','رامسر','فریدون‌کنار','محمودآباد'
  ],
  'مرکزی': [
    'اراک','ساوه','محلات','خمین','شازند','دلیجان','تفرش','آشتیان','زرندیه','کمیجان'
  ],
  'هرمزگان': [
    'بندرعباس','قشم','کیش','میناب','بندر لنگه','بستک','جاسک','حاجی‌آباد','رودان','پارسیان','سیریک'
  ],
  'همدان': [
    'همدان','ملایر','نهاوند','بهار','کبودرآهنگ','اسدآباد','فامنین','رزن'
  ],
  'یزد': [
    'یزد','میبد','اردکان','بافق','ابرکوه','مهریز','اشکذر','خاتم','تفت'
  ]
};

export const provinces = Object.keys(provincesAndCities);
